import re

MCC_MAP: dict[str, list[int]] = {
    "Топливо, АЗС": [5983, 5541, 5542],
    "Автомойка": [7542],

    "Одежда и обувь": [5691, 5137, 5611, 5661, 5621, 5651],

    "Такси и каршеринг": list(range(3351, 3442)) + [4121, 7512, 3990],

    "Фастфуд": [5814],

    "Электроника и техника": [5722, 5732, 5946],

    "Строительные материалы": [5039, 5198, 5211, 5231, 5251, 5713, 5714, 5712, 5074],
    "Товары для дома": [5200, 5718, 5719, 5021, 5261],

    "Автосервисы и запчасти": [7531, 7534, 7535, 7538, 5511, 5521, 5532, 5533],

    "Салоны красоты и СПА": [7230, 7297, 7298],

    "Спортивные магазины": [5655, 5940, 5941],

    "Фитнес": [7941, 7997],

    "Турагентства": [5962, 4722, 4723, 7032, 7033, 4411],

    "Отели": list(range(3501, 3990)) + list(range(3991, 4000)) + [7011],

    "Авиабилеты и ЖД билеты": [
        *list(range(3000, 3302)), 4511, 4582, 4304, 4415, 4418, 4011, 4112
    ],

    "Аптеки": [5122, 5912],

    "Медицинские услуги": [
        8011, 5976, 8031, 8042, 8043, 8049, 8050, 8062, 8021, 8071
    ],

    "Рестораны и кафе": [5811, 5812, 5813],

    "Театры, музеи и выставки": [7922, 7991, 7996, 7998, 7999],

    "Маркетплейсы": [5262, 5300, 7278],

    "Образование": [8211, 8220, 8241, 8244, 8249, 8299, 8351],

    "Детские товары": [5641, 5945],

    "Косметика": [5977],

    "Книги": [2741, 5192, 5942, 5994],

    "Цветы": [5193, 5992],

    "Кино": [7829, 7832, 7841],

    "Канцтовары": [5111, 5943],

    "Товары для животных": [742, 5995],

    "Бытовые услуги": [
        7210, 7211, 7216, 7217, 7251, 7349, 7379, 7622, 7623, 7629, 7641, 7692, 7699
    ],

    "Связь, интернет, ТВ": [4899, 4813, 4815, 4821, 4816, 4814],
}


class MCCHelper:
    """
    Утилиты для работы с MCC-кодами платёжных систем.
    """

    @staticmethod
    def extract_mcc(description: str) -> int | None:
        """
        Извлекает MCC-код из описания операции.

        Args:
            description (str): Текст описания транзакции.

        Returns:
            Optional[int]: MCC-код или None, если он не найден.
        """
        m = re.search(r"mcc[:\s]*([0-9]{4})", description.lower())
        if m:
            return int(m.group(1))
        return None

    @staticmethod
    def classify_by_mcc(mcc: int | None) -> str | None:
        """
        Определяет категорию расходов по MCC-коду.

        Args:
            mcc (Optional[int]): MCC-код операции.

        Returns:
            Optional[str]: Название категории или None, если не найдено.
        """
